# Дана строка. Удалите из этой строки все символы @.
line = "lorem@ipsum@dolor@sit@amet"

line = line.replace("@", " ")
print(line)
