# Створіть список, що складається з чотирьох рядків. Потім,
# за допомогою циклу for, виведіть рядки по черзі на екран.
# Змініть попередню програму так, щоб в кінці кожної букви рядка додавалося тире.
# (Підказка: цикл for може бути вкладений в інший цикл.)
# Створіть список, що містить елементи цілочисельного типу,
# потім за допомогою циклу перебору змініть тип даних елементів
# на числа з плаваючою крапкою. (Підказка: використовуйте вбудовану функцію float ().)

fishText = ["lorem", "ipsum", "dolor", "sit"]
for i in fishText:
    print(i)

for i in fishText:
    print(''.join('{}-'.format(x) for x in i))

numbers = [1, 2, 3, 4, 5]

for i in numbers:
    print(float(i))


# Напишіть функцію, яка обчислює суму трьох чисел і повертає результат в основну гілку програми.
# Придумайте програму, в якій з однієї функції викликається друга.
# При цьому жодна з них нічого не повертає в основну гілку програми,
# обидві повинні виводити результати своєї роботи за допомогою функції print().


def sum(a, b, c):
    return a + b + c


def finishMessage():
    print("Finish!")


def multiplier():
    print("*** a lot of code works ***")
    finishMessage()


# Створіть функцію:
# def func1(num):
#     n = num * 5
#     print (n)
#
# Викличте її, передавши в якості аргумента значення глобальної змінної,
# потім будь-яке число і, нарешті, будь-який рядок.
# 2. Виконайте за допомогою інтерпретатора Python скрипт,
# попередньо виправивши код функції так, щоб вона повертала значення змінної n:
# >>> def func(n):
#     if n < 3:
#         n = n*10
# >>> a = 2
# >>> b = func(a)
# >>> a
# 2
# >>> b # Чому з змінною не пов'язано жодного значення?

a = 5


def func1(num):
    n = num * 5
    print(n)


func1(a)
func1(10)
func1("a")


def func(n):
    if n < 3:
        n = n * 10
        return n
    a = 2
    b = func(a)
    print(b)


func(5)
